src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Если НЕ (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ Проведен) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			
			ТекстСообщения = СтрШаблон("У сотрудника %1 дата окончания отпуска (%2) не может быть меньше даты начала (%3)!", 
				Строка.Сотрудник, 
				Формат(Строка.ДатаОкончания, "ДФ=dd.MM.yyyy"), 
				Формат(Строка.ДатаНачала, "ДФ=dd.MM.yyyy"));
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ОтпускаСотрудников[" + ОтпускаСотрудников.Индекс(Строка) + "].ДатаОкончания";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Год) И (Год(Строка.ДатаНачала) <> Год(Год)) Тогда
			
			ТекстСообщения = СтрШаблон("Отпуск сотрудника %1 назначен на %2 год, что не соответствует году документа (%3)!", 
				Строка.Сотрудник, 
				Год(Строка.ДатаНачала), 
				Год(Год));
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ОтпускаСотрудников[" + ОтпускаСотрудников.Индекс(Строка) + "].ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
